In [24]:
import pandas as pd

In [25]:
data = {
        'Name':['Alice','Bob','Charlie','Arpita','Keanu','Olaf'],
        'Marks':[80,70,90,68,66,66]
    }

df=pd.DataFrame(data)

In [26]:
print(df)

      Name  Marks
0    Alice     80
1      Bob     70
2  Charlie     90
3   Arpita     68
4    Keanu     66
5     Olaf     66

In [27]:
df.head()

      Name  Marks
0    Alice     80
1      Bob     70
2  Charlie     90
3   Arpita     68
4    Keanu     66

In [28]:
df.tail(1)

   Name  Marks
5  Olaf     66

In [29]:
df.describe()

           Marks
count   6.000000
mean   73.333333
std     9.688481
min    66.000000
25%    66.500000
50%    69.000000
75%    77.500000
max    90.000000

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
dtypes: int64(1), object(1)
memory usage: 228.0+ bytes

In [31]:
print(df.shape)

(6, 2)

In [32]:
print(df.columns)

Index(['Name', 'Marks'], dtype='object')

In [33]:
df.dtypes

Name     object
Marks     int64
dtype: object

In [34]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [35]:
df.sample(2)

     Name  Marks
0   Alice     80
3  Arpita     68

In [36]:
print(df.sort_values(by='Marks',ascending = True))

      Name  Marks
5     Olaf     66
4    Keanu     66
3   Arpita     68
1      Bob     70
0    Alice     80
2  Charlie     90

In [37]:
print(df['Marks'].value_counts())

Marks
66    2
80    1
70    1
90    1
68    1
Name: count, dtype: int64

In [41]:
print(df[df['Marks'] > 70])

      Name  Marks
0    Alice     80
2  Charlie     90

In [16]:
data = {
        'Product Name':['Apple','Mango','Banana','Kiwi','Jackfruit','Passionfruit'],
        'Price':[20,30,30,80,40,90]
    }

df=pd.DataFrame(data)

In [17]:
print(df)

   Product Name  Price
0         Apple     20
1         Mango     30
2        Banana     30
3          Kiwi     80
4     Jackfruit     40
5  Passionfruit     90

In [18]:
df['Price']

0    20
1    30
2    30
3    80
4    40
5    90
Name: Price, dtype: int64

In [19]:
df.loc[3,'Price']

np.int64(80)

In [20]:
df.iloc[2,0]

'Banana'

In [22]:
print(df[df['Price'] < 80])

  Product Name  Price
0        Apple     20
1        Mango     30
2       Banana     30
4    Jackfruit     40